In [1]:
import os
import re
import sys
import copy

ROOT = os.path.join(os.path.dirname(os.getcwd()), 'backend')
if ROOT not in sys.path:
    sys.path.append(ROOT)
    
from moz_sql_parser import parse as ps
sys.setrecursionlimit(1000000)
import json
import os
import pandas as pd
from termcolor import colored
import numpy as np
from sentence_transformers import SentenceTransformer, util
from sklearn.cluster import AgglomerativeClustering
model = SentenceTransformer('paraphrase-MiniLM-L6-v2')

In [2]:
from app.dataService.dataService import DataService

In [3]:
# Generate SQL and the execution results from the plain text
text = "films and film prices that cost below 10 dollars"
db_id = "cinema"
dataService = DataService("spider")

=== begin loading model ===
before load_trees
before connecting
before load_trees
before connecting

Some weights of the model checkpoint at Salesforce/grappa_large_jnt were not used when initializing RobertaModel: ['lm_head.bias', 'lm_head.decoder.weight', 'lm_head.dense_col.bias', 'lm_head.bias_col', 'q_tab_dense.bias', 'lm_head.dense.bias', 'lm_head.layer_norm_col.weight', 'lm_head.layer_norm.bias', 'lm_head.layer_norm.weight', 'lm_head.dense.weight', 'lm_head.decoder_col.weight', 'q_tab_dense.weight', 'lm_head.layer_norm_col.bias', 'lm_head.dense_col.weight']
- This IS expected if you are initializing RobertaModel from the checkpoint of a model trained on another task or with another architecture (e.g. initializing a BertForSequenceClassification model from a BertForPreTraining model).
- This IS NOT expected if you are initializing RobertaModel from the checkpoint of a model that you expect to be exactly identical (initializing a BertForSequenceClassification model from a BertForSequenceClassification model).

{'amp': True, 'base_dim': 32, 'batch_size': 20, 'beam_encoder_num_layers': 1, 'cntx_beam': False, 'cntx_rep': False, 'cntx_reranker': True, 'debug': False, 'disentangle_cntx': True, 'embedding_dim': 256, 'grad_acum': 4, 'grad_clip': None, 'grad_norm': None, 'is_oracle': False, 'lin_after_cntx': False, 'lm_lr': 3e-06, 'load_less': False, 'lr': 0.000186, 'max_steps': 60000, 'num_heads': 8, 'power': 0.5, 'rat_dropout': 0.2, 'rat_layers': 8, 'should_rerank': False, 'temperature': 1, 'tfixup': False, 'tiny_dataset': False, 'train_as_dev': False, 'tree_rep_transformer_num_layers': 1, 'uniquify': False, 'use_bce': False, 'use_treelstm': False, 'utt_aug': True, 'value_pred': True}
=== finish loading model ===

In [4]:
# read spider dataset
dataset_type = "train_spider"
with open(f"../backend/app/data/dataset/spider/{dataset_type}.json", "r") as f:
    spider_data = json.load(f)
df = pd.DataFrame(spider_data)

In [5]:
df

,db_id,query,query_toks,query_toks_no_value,question,question_toks,sql
0,department_management,SELECT count(*) FROM head WHERE age > 56,"[SELECT, count, (, *, ), FROM, head, WHERE, ag...","[select, count, (, *, ), from, head, where, ag...",How many heads of the departments are older th...,"[How, many, heads, of, the, departments, are, ...","{'from': {'table_units': [['table_unit', 1]], ..."
1,department_management,"SELECT name , born_state , age FROM head ORD...","[SELECT, name, ,, born_state, ,, age, FROM, he...","[select, name, ,, born_state, ,, age, from, he...","List the name, born state and age of the heads...","[List, the, name, ,, born, state, and, age, of...","{'from': {'table_units': [['table_unit', 1]], ..."
2,department_management,"SELECT creation , name , budget_in_billions ...","[SELECT, creation, ,, name, ,, budget_in_billi...","[select, creation, ,, name, ,, budget_in_billi...","List the creation year, name and budget of eac...","[List, the, creation, year, ,, name, and, budg...","{'from': {'table_units': [['table_unit', 0]], ..."
3,department_management,"SELECT max(budget_in_billions) , min(budget_i...","[SELECT, max, (, budget_in_billions, ), ,, min...","[select, max, (, budget_in_billions, ), ,, min...",What are the maximum and minimum budget of the...,"[What, are, the, maximum, and, minimum, budget...","{'from': {'table_units': [['table_unit', 0]], ..."
4,department_management,SELECT avg(num_employees) FROM department WHER...,"[SELECT, avg, (, num_employees, ), FROM, depar...","[select, avg, (, num_employees, ), from, depar...",What is the average number of employees of the...,"[What, is, the, average, number, of, employees...","{'from': {'table_units': [['table_unit', 0]], ..."
...,...,...,...,...,...,...,...
6995,culture_company,SELECT T1.company_name FROM culture_company AS...,"[SELECT, T1.company_name, FROM, culture_compan...","[select, t1, ., company_name, from, culture_co...",What are all the company names that have a boo...,"[What, are, all, the, company, names, that, ha...","{'from': {'table_units': [['table_unit', 2], [..."
6996,culture_company,"SELECT T1.title , T3.book_title FROM movie AS...","[SELECT, T1.title, ,, T3.book_title, FROM, mov...","[select, t1, ., title, ,, t3, ., book_title, f...",Show the movie titles and book titles for all ...,"[Show, the, movie, titles, and, book, titles, ...","{'from': {'table_units': [['table_unit', 1], [..."
6997,culture_company,"SELECT T1.title , T3.book_title FROM movie AS...","[SELECT, T1.title, ,, T3.book_title, FROM, mov...","[select, t1, ., title, ,, t3, ., book_title, f...",What are the titles of movies and books corres...,"[What, are, the, titles, of, movies, and, book...","{'from': {'table_units': [['table_unit', 1], [..."
6998,culture_company,SELECT T2.company_name FROM movie AS T1 JOIN c...,"[SELECT, T2.company_name, FROM, movie, AS, T1,...","[select, t2, ., company_name, from, movie, as,...",Show all company names with a movie directed i...,"[Show, all, company, names, with, a, movie, di...","{'from': {'table_units': [['table_unit', 1], [..."
6999,culture_company,SELECT T2.company_name FROM movie AS T1 JOIN c...,"[SELECT, T2.company_name, FROM, movie, AS, T1,...","[select, t2, ., company_name, from, movie, as,...",What are all company names that have a corresp...,"[What, are, all, company, names, that, have, a...","{'from': {'table_units': [['table_unit', 1], [..."

## parse sql templates

### 1. sql select

In [118]:
# 'select': (isDistinct(bool), [(agg_id, val_unit), (agg_id, val_unit), ...])
# val_unit: (unit_op, col_unit1, col_unit2)
# col_unit: (agg_id, col_id, isDistinct(bool))

# 'from': {'table_units': [table_unit1, table_unit2, ...], 'conds': condition}
# table_unit: (table_type, col_unit/sql)

split_symbol = ";"
select_dict = {
    "phrases": {},
    "distinct": {},
    "count": {
        "phrases": {},
        "distinct": {}
    },
    "max": {},
    "min": {},
    "sum": {},
    "avg": {},
    "+": {},
    "-": {},
    "*": {},
    "/": {},
}

for rowid, row in df[["query", "db_id", "question"]].iterrows():
    if rowid != 3153:
        db_id = row["db_id"]
        sql = row["query"]
        parsed = dataService.parsesql(sql, db_id)
        
        sql_label = parsed["sql_parse"]
        table = parsed["table"]
        table_names = table["table_names"]
        columns = table["column_names"]
        
        select = sql_label["select"]
        from_ = sql_label["from"]
        table_units = from_["table_units"]
        distinct_flag = select[0]
        
        
        for s in select[1]:
            agg_id = dataService.global_variable.AGG_OPS[s[0]]
            val_unit = s[1]
            unit_ops = dataService.global_variable.UNIT_OPS[val_unit[0]]
            # --- col unit1: agg_id, col_id, isDistinct(bool)
            col_unit1 = val_unit[1]            
            col_agg_id1 = dataService.global_variable.AGG_OPS[col_unit1[0]]
            col1 = columns[col_unit1[1]]
            col_distinct_flag1 = col_unit1[2]
            table_id1 = col1[0]
            col_name1 = col1[1]
            select_name1 = table_names[table_id1] + " " + col_name1
            
            if col_distinct_flag1:
                print(colored(agg_id, "red"), colored(col_agg_id1, "blue"), sql)
            
            if col_agg_id1 != "none":
                print(sql)
            
            if unit_ops != "none":                
                # --- col unit2
                col_unit2 = val_unit[2]
                col2 = columns[col_unit2[1]]
                table_id2 = col2[0]
                col_name2 = col2[1]
                select_name2 = table_names[table_id2] + " " + col_name2
                select_item = split_symbol.join([select_name1, select_name2])
                if select_item not in select_dict[unit_ops].keys():
                    select_dict[unit_ops][select_item] = 0
                select_dict[unit_ops][select_item] += 1
            else:
                # one col_unit
                if distinct_flag:
                    # --- distinct
                    if len(select[1]) > 1:
                        print(colored(sql, "yellow"))
                else:
                    if col_agg_id1 != "none":
                        print(colored(f"{agg_id}-{col_agg_id1} " + select_name1, "yellow"))
#                     if col_agg_id1 != "none":
#                         print(colored(f"{agg_id}-{col_agg_id1}" + select_name1, "blue"))

count none SELECT count(DISTINCT temporary_acting) FROM management
count none SELECT count(DISTINCT Status) FROM city
count none SELECT count(DISTINCT Status) FROM city
count none SELECT count(DISTINCT bike_id) FROM trip
count none SELECT count(DISTINCT bike_id) FROM trip
count none SELECT count(DISTINCT city) FROM station
count none SELECT count(DISTINCT city) FROM station
SELECT DISTINCT T1.id ,  T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  >  12
SELECT DISTINCT T1.id ,  T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  >  12
SELECT DISTINCT T1.id ,  T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  >  12
SELECT DISTINCT T1.id ,  T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  >  12
count none SELECT COUNT (DISTINCT Publication_Date) FROM publication
count none SELECT COUNT (DISTINCT Publication_Date) FROM publication
count none SELECT count(DISTINCT UID) FROM tweets
count none SELECT count(DISTINCT eid) FROM Certificate
count none SELECT count(DISTINCT eid) FROM Certificate
count none SELECT count(DISTINCT allergy) FROM Allergy_type
count none SELECT count(DISTINCT allergy) FROM Allergy_type
count none SELECT count(DISTINCT allergytype) FROM Allergy_type
count none SELECT count(DISTINCT allergytype) FROM Allergy_type
count none SELECT count(DISTINCT advisor) FROM Student
count none SELECT count(DISTINCT advisor) FROM Student
SELECT DISTINCT T1.fname ,  T1.city_code FROM Student AS T1 JOIN Has_Allergy AS T2 ON T1.stuid  =  T2.stuid WHERE T2.Allergy  =  "Milk" OR T2.Allergy  =  "Cat"
SELECT DISTINCT T1.fname ,  T1.city_code FROM Student AS T1 JOIN Has_Allergy AS T2 ON T1.stuid  =  T2.stuid WHERE T2.Allergy  =  "Milk" OR T2.Allergy  =  "Cat"
SELECT DISTINCT T1.fname ,  T1.city_code FROM Student AS T1 JOIN Has_Allergy AS T2 ON T1.stuid  =  T2.stuid WHERE T2.Allergy  =  "Milk" OR T2.Allergy  =  "Cat"
SELECT DISTINCT T1.fname ,  T1.city_code FROM Student AS T1 JOIN Has_Allergy AS T2 ON T1.stuid  =  T2.stuid WHERE T2.Allergy  =  "Milk" OR T2.Allergy  =  "Cat"
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
count none SELECT count(DISTINCT customer_id) FROM Accounts
count none SELECT count(DISTINCT customer_id) FROM Accounts
count none SELECT card_type_code ,  count(DISTINCT customer_id) FROM Customers_cards GROUP BY card_type_code
count none SELECT card_type_code ,  count(DISTINCT customer_id) FROM Customers_cards GROUP BY card_type_code
count none SELECT count(DISTINCT card_type_code) FROM Customers_Cards
count none SELECT count(DISTINCT card_type_code) FROM Customers_Cards
count none SELECT count(DISTINCT transaction_type) FROM Financial_Transactions
count none SELECT count(DISTINCT transaction_type) FROM Financial_Transactions
count none SELECT COUNT(DISTINCT city) FROM EMPLOYEE
count none SELECT COUNT(DISTINCT city) FROM EMPLOYEE
SELECT DISTINCT T1.name ,  T1.location ,  T1.product FROM enzyme AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.enzyme_id  =  T1.id WHERE T2.interaction_type  =  'inhibitor'
SELECT DISTINCT T1.name ,  T1.location ,  T1.product FROM enzyme AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.enzyme_id  =  T1.id WHERE T2.interaction_type  =  'inhibitor'
SELECT DISTINCT T1.name ,  T1.location ,  T1.product FROM enzyme AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.enzyme_id  =  T1.id WHERE T2.interaction_type  =  'inhibitor'
SELECT DISTINCT T1.name ,  T1.location ,  T1.product FROM enzyme AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.enzyme_id  =  T1.id WHERE T2.interaction_type  =  'inhibitor'
SELECT DISTINCT T1.name ,  T1.location ,  T1.product FROM enzyme AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.enzyme_id  =  T1.id WHERE T2.interaction_type  =  'inhibitor'
SELECT DISTINCT T1.name ,  T1.location ,  T1.product FROM enzyme AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.enzyme_id  =  T1.id WHERE T2.interaction_type  =  'inhibitor'
count none SELECT count(DISTINCT FDA_approved) FROM medicine
count none SELECT count(DISTINCT FDA_approved) FROM medicine
count none SELECT count(DISTINCT school_id) FROM basketball_match
count none SELECT count(DISTINCT school_id) FROM basketball_match
count none SELECT count(DISTINCT affiliation) FROM university
count none SELECT count(DISTINCT affiliation) FROM university
SELECT DISTINCT T2.Hardware_Model_name , T2.Company_name FROM screen_mode AS T1 JOIN phone AS T2 ON T1.Graphics_mode = T2.screen_mode WHERE T1.used_kb BETWEEN 10 AND 15;
SELECT DISTINCT T2.Hardware_Model_name , T2.Company_name FROM screen_mode AS T1 JOIN phone AS T2 ON T1.Graphics_mode = T2.screen_mode WHERE T1.used_kb BETWEEN 10 AND 15;
count none SELECT count(DISTINCT Team) FROM match_season
count none SELECT count(DISTINCT Team) FROM match_season
count none SELECT count(DISTINCT T1.Official_native_language) FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country WHERE T2.Position  =  "Defender"
count none SELECT count(DISTINCT T1.Official_native_language) FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country WHERE T2.Position  =  "Defender"
count none SELECT count(DISTINCT T1.College) FROM match_season AS T1 JOIN team AS T2 ON T1.Team  =  T2.Team_id WHERE T2.Name  =  "Columbus Crew"
count none SELECT count(DISTINCT T1.College) FROM match_season AS T1 JOIN team AS T2 ON T1.Team  =  T2.Team_id WHERE T2.Name  =  "Columbus Crew"
count none SELECT COUNT(DISTINCT Country) FROM climber
count none SELECT COUNT(DISTINCT Country) FROM climber
count none SELECT count(DISTINCT Birth_Place) FROM people
count none SELECT count(DISTINCT Party) FROM representative
count none SELECT count(DISTINCT SOURCE) FROM injury_accident
count none SELECT count(DISTINCT T1.injury) FROM injury_accident AS T1 JOIN game AS T2 ON T1.game_id  =  T2.id WHERE T2.season  >  2010
SELECT DISTINCT T1.player_name ,  T1.birthday FROM Player AS T1 JOIN Player_Attributes AS T2 ON T1.player_api_id  =  T2.player_api_id ORDER BY potential DESC LIMIT 5
SELECT DISTINCT T1.player_name ,  T1.birthday FROM Player AS T1 JOIN Player_Attributes AS T2 ON T1.player_api_id  =  T2.player_api_id ORDER BY potential DESC LIMIT 5
count none SELECT count(DISTINCT s_id) FROM advisor
count none SELECT count(DISTINCT s_id) FROM advisor
count none SELECT count(DISTINCT dept_name) FROM course
count none SELECT count(DISTINCT dept_name) FROM course
count none SELECT count(DISTINCT course_id) FROM course WHERE dept_name  =  'Physics'
count none SELECT count(DISTINCT course_id) FROM course WHERE dept_name  =  'Physics'
count none SELECT COUNT (DISTINCT id) FROM teaches
count none SELECT COUNT (DISTINCT id) FROM teaches
count none SELECT count(DISTINCT T2.id) ,  count(DISTINCT T3.id) ,  T3.dept_name FROM department AS T1 JOIN student AS T2 ON T1.dept_name  =  T2.dept_name JOIN instructor AS T3 ON T1.dept_name  =  T3.dept_name GROUP BY T3.dept_name
count none SELECT count(DISTINCT T2.id) ,  count(DISTINCT T3.id) ,  T3.dept_name FROM department AS T1 JOIN student AS T2 ON T1.dept_name  =  T2.dept_name JOIN instructor AS T3 ON T1.dept_name  =  T3.dept_name GROUP BY T3.dept_name
count none SELECT count(DISTINCT T2.id) ,  count(DISTINCT T3.id) ,  T3.dept_name FROM department AS T1 JOIN student AS T2 ON T1.dept_name  =  T2.dept_name JOIN instructor AS T3 ON T1.dept_name  =  T3.dept_name GROUP BY T3.dept_name
count none SELECT count(DISTINCT T2.id) ,  count(DISTINCT T3.id) ,  T3.dept_name FROM department AS T1 JOIN student AS T2 ON T1.dept_name  =  T2.dept_name JOIN instructor AS T3 ON T1.dept_name  =  T3.dept_name GROUP BY T3.dept_name
count none SELECT COUNT (DISTINCT ID) FROM teaches WHERE semester  =  'Spring' AND YEAR  =  2010
count none SELECT COUNT (DISTINCT ID) FROM teaches WHERE semester  =  'Spring' AND YEAR  =  2010

count none SELECT count(DISTINCT claim_outcome_code) FROM claims_processing
count none SELECT count(DISTINCT claim_outcome_code) FROM claims_processing
count none SELECT count(DISTINCT customer_id) FROM Accounts
count none SELECT count(DISTINCT customer_id) FROM Accounts
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name ,  T1.phone_number FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name ,  T1.phone_number FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name ,  T1.phone_number FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name ,  T1.phone_number FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name ,  T1.phone_number FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name ,  T1.phone_number FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
count none SELECT product_id ,  count(DISTINCT order_id) FROM Order_items GROUP BY product_id
count none SELECT product_id ,  count(DISTINCT order_id) FROM Order_items GROUP BY product_id
count none SELECT order_id ,  count(DISTINCT product_id) FROM Order_items GROUP BY order_id
count none SELECT order_id ,  count(DISTINCT product_id) FROM Order_items GROUP BY order_id
count none SELECT COUNT (DISTINCT church_id) FROM wedding WHERE YEAR  =  2016
count none SELECT count(DISTINCT u_id) FROM review
count none SELECT count(DISTINCT i_id) FROM review
count none SELECT count(DISTINCT Hometown) FROM people
count none SELECT count(DISTINCT Hometown) FROM people
count none SELECT count(DISTINCT client) FROM web_client_accelerator
count none SELECT COUNT (DISTINCT team) FROM elimination
count none SELECT COUNT (DISTINCT team) FROM elimination
count none SELECT count(DISTINCT T1.donator_name) FROM endowment AS T1 JOIN school AS T2 ON T1.school_id  =  T2.school_id WHERE T2.school_name  =  "Glenn"
count none SELECT count(DISTINCT product_type_code) FROM products_for_hire
count none SELECT count(DISTINCT party_name) FROM party
count none SELECT count(DISTINCT party_name) FROM party
count none SELECT document_id ,  count(DISTINCT employee_id) FROM Circulation_History GROUP BY document_id;
count none SELECT count(DISTINCT participant_id) FROM participants_in_Events
SELECT DISTINCT T1.forename ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds < 93000
SELECT DISTINCT T1.forename ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds < 93000
SELECT DISTINCT T1.forename ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds < 93000
SELECT DISTINCT T1.forename ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds < 93000
SELECT DISTINCT T1.driverid ,  T1.nationality FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds >  100000
SELECT DISTINCT T1.driverid ,  T1.nationality FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds >  100000
SELECT DISTINCT T1.driverid ,  T1.nationality FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds >  100000
SELECT DISTINCT T1.driverid ,  T1.nationality FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds >  100000
count none SELECT count(DISTINCT driverId) FROM results WHERE raceId NOT IN( SELECT raceId FROM races WHERE YEAR != 2009 )
count none SELECT count(DISTINCT driverId) FROM results WHERE raceId NOT IN( SELECT raceId FROM races WHERE YEAR != 2009 )
SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  <  (SELECT max(duration) FROM pitstops WHERE raceid  =  841)
SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  <  (SELECT max(duration) FROM pitstops WHERE raceid  =  841)
SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  <  (SELECT max(duration) FROM pitstops WHERE raceid  =  841)
SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  <  (SELECT max(duration) FROM pitstops WHERE raceid  =  841)
SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  >  (SELECT min(duration) FROM pitstops WHERE raceid  =  841)
SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  >  (SELECT min(duration) FROM pitstops WHERE raceid  =  841)
SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  >  (SELECT min(duration) FROM pitstops WHERE raceid  =  841)
SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  >  (SELECT min(duration) FROM pitstops WHERE raceid  =  841)
count none SELECT count(DISTINCT Company) FROM entrepreneur
count none SELECT count(DISTINCT Company) FROM entrepreneur
count none SELECT count(DISTINCT LOCATION) FROM perpetrator
SELECT DISTINCT T3.name ,  T2.title ,  T1.stars FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID JOIN Reviewer AS T3 ON T1.rID  =  T3.rID WHERE T2.director  =  T3.name
SELECT DISTINCT T3.name ,  T2.title ,  T1.stars FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID JOIN Reviewer AS T3 ON T1.rID  =  T3.rID WHERE T2.director  =  T3.name
SELECT DISTINCT T3.name ,  T2.title ,  T1.stars FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID JOIN Reviewer AS T3 ON T1.rID  =  T3.rID WHERE T2.director  =  T3.name
SELECT DISTINCT T3.name ,  T2.title ,  T1.stars FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID JOIN Reviewer AS T3 ON T1.rID  =  T3.rID WHERE T2.director  =  T3.name
SELECT DISTINCT T3.name ,  T2.title ,  T1.stars FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID JOIN Reviewer AS T3 ON T1.rID  =  T3.rID WHERE T2.director  =  T3.name
SELECT DISTINCT T3.name ,  T2.title ,  T1.stars FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID JOIN Reviewer AS T3 ON T1.rID  =  T3.rID WHERE T2.director  =  T3.name
count none SELECT count(DISTINCT bedType) FROM Rooms;
count none SELECT count(DISTINCT bedType) FROM Rooms;
count none SELECT count(DISTINCT source_system_code) FROM CMI_cross_references
count none SELECT count(DISTINCT region_id) FROM affected_region
count none SELECT count(DISTINCT region_id) FROM affected_region
count none SELECT count(DISTINCT Governor) FROM party
count none SELECT count(DISTINCT Governor) FROM party
count none SELECT count(DISTINCT T2.Delegate) FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District WHERE T1.Population  >  50000
count none SELECT count(DISTINCT T2.Delegate) FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District WHERE T1.Population  >  50000
count none SELECT count(DISTINCT payment_method) FROM customers
SELECT DISTINCT t1.fname ,  t1.lname FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "University of Oxford"
SELECT DISTINCT t1.fname ,  t1.lname FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "University of Oxford"
SELECT DISTINCT t1.fname ,  t1.lname FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "University of Oxford"
SELECT DISTINCT t1.fname ,  t1.lname FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "University of Oxford"
SELECT DISTINCT t1.fname ,  t1.lname FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "Google"
SELECT DISTINCT t1.fname ,  t1.lname FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "Google"
SELECT DISTINCT t1.fname ,  t1.lname FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "Google"
SELECT DISTINCT t1.fname ,  t1.lname FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "Google"
count none SELECT count(DISTINCT t1.title) FROM papers AS t1 JOIN authorship AS t2 ON t1.paperid  =  t2.paperid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "Tokohu University"
count none SELECT count(DISTINCT t1.title) FROM papers AS t1 JOIN authorship AS t2 ON t1.paperid  =  t2.paperid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "Tokohu University"
count none SELECT count(DISTINCT t1.title) FROM papers AS t1 JOIN authorship AS t2 ON t1.paperid  =  t2.paperid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "University of Pennsylvania"
count none SELECT count(DISTINCT t1.title) FROM papers AS t1 JOIN authorship AS t2 ON t1.paperid  =  t2.paperid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "University of Pennsylvania"
count none SELECT count(DISTINCT last_name) FROM actor
count none SELECT count(DISTINCT last_name) FROM actor
count none SELECT count(DISTINCT language_id) FROM film
count none SELECT count(DISTINCT language_id) FROM film
count none SELECT count(DISTINCT rating) FROM film
count none SELECT count(DISTINCT rating) FROM film
SELECT DISTINCT T1.first_name ,  T1.last_name FROM staff AS T1 JOIN rental AS T2 ON T1.staff_id  =  T2.staff_id JOIN customer AS T3 ON T2.customer_id  =  T3.customer_id WHERE T3.first_name  =  'APRIL' AND T3.last_name  =  'BURNS'
SELECT DISTINCT T1.first_name ,  T1.last_name FROM staff AS T1 JOIN rental AS T2 ON T1.staff_id  =  T2.staff_id JOIN customer AS T3 ON T2.customer_id  =  T3.customer_id WHERE T3.first_name  =  'APRIL' AND T3.last_name  =  'BURNS'
SELECT DISTINCT T1.first_name ,  T1.last_name FROM staff AS T1 JOIN rental AS T2 ON T1.staff_id  =  T2.staff_id JOIN customer AS T3 ON T2.customer_id  =  T3.customer_id WHERE T3.first_name  =  'APRIL' AND T3.last_name  =  'BURNS'
SELECT DISTINCT T1.first_name ,  T1.last_name FROM staff AS T1 JOIN rental AS T2 ON T1.staff_id  =  T2.staff_id JOIN customer AS T3 ON T2.customer_id  =  T3.customer_id WHERE T3.first_name  =  'APRIL' AND T3.last_name  =  'BURNS'
count none SELECT count(DISTINCT city) FROM bank
count none SELECT count(DISTINCT city) FROM bank
count none SELECT count(DISTINCT state) FROM bank
count none SELECT count(DISTINCT state) FROM bank
count none SELECT count(DISTINCT acc_type) FROM customer
count none SELECT count(DISTINCT acc_type) FROM customer
SELECT DISTINCT T1.cust_name ,  T1.credit_score FROM customer AS T1 JOIN loan AS T2 ON T1.cust_id  =  T2.cust_id
SELECT DISTINCT T1.cust_name ,  T1.credit_score FROM customer AS T1 JOIN loan AS T2 ON T1.cust_id  =  T2.cust_id
SELECT DISTINCT T1.cust_name ,  T1.credit_score FROM customer AS T1 JOIN loan AS T2 ON T1.cust_id  =  T2.cust_id
SELECT DISTINCT T1.cust_name ,  T1.credit_score FROM customer AS T1 JOIN loan AS T2 ON T1.cust_id  =  T2.cust_id
count none SELECT count(DISTINCT incident_type_code) FROM Behavior_Incident
count none SELECT count(DISTINCT student_id) FROM Students_in_Detention

count none SELECT count(DISTINCT services) FROM station
count none SELECT count(DISTINCT PROF_NUM) FROM CLASS WHERE CRS_CODE  =  "ACCT-211"
count none SELECT count(DISTINCT PROF_NUM) FROM CLASS WHERE CRS_CODE  =  "ACCT-211"
SELECT DISTINCT T1.EMP_FNAME ,  T1.EMP_DOB FROM employee AS T1 JOIN CLASS AS T2 ON T1.EMP_NUM  =  T2.PROF_NUM WHERE CRS_CODE  =  "ACCT-211"
SELECT DISTINCT T1.EMP_FNAME ,  T1.EMP_DOB FROM employee AS T1 JOIN CLASS AS T2 ON T1.EMP_NUM  =  T2.PROF_NUM WHERE CRS_CODE  =  "ACCT-211"
SELECT DISTINCT T1.EMP_FNAME ,  T1.EMP_DOB FROM employee AS T1 JOIN CLASS AS T2 ON T1.EMP_NUM  =  T2.PROF_NUM WHERE CRS_CODE  =  "ACCT-211"
SELECT DISTINCT T1.EMP_FNAME ,  T1.EMP_DOB FROM employee AS T1 JOIN CLASS AS T2 ON T1.EMP_NUM  =  T2.PROF_NUM WHERE CRS_CODE  =  "ACCT-211"
count none SELECT count(DISTINCT dept_address) FROM department WHERE school_code  =  'BUS'
count none SELECT count(DISTINCT dept_address) FROM department WHERE school_code  =  'BUS'
count none SELECT count(DISTINCT dept_address) ,  school_code FROM department GROUP BY school_code
count none SELECT count(DISTINCT dept_address) ,  school_code FROM department GROUP BY school_code
count none SELECT count(DISTINCT dept_name) ,  school_code FROM department GROUP BY school_code
count none SELECT count(DISTINCT dept_name) ,  school_code FROM department GROUP BY school_code
count none SELECT count(DISTINCT dept_name) ,  school_code FROM department GROUP BY school_code HAVING count(DISTINCT dept_name)  <  5
count none SELECT count(DISTINCT dept_name) ,  school_code FROM department GROUP BY school_code HAVING count(DISTINCT dept_name)  <  5
count none SELECT count(DISTINCT school_code) FROM department
count none SELECT count(DISTINCT school_code) FROM department
count none SELECT count(DISTINCT class_code) FROM CLASS
count none SELECT count(DISTINCT class_code) FROM CLASS
count none SELECT count(DISTINCT crs_code) FROM CLASS
count none SELECT count(DISTINCT crs_code) FROM CLASS
count none SELECT count(DISTINCT dept_name) FROM department
count none SELECT count(DISTINCT dept_name) FROM department
count none SELECT count(DISTINCT class_section) FROM CLASS WHERE crs_code  =  'ACCT-211'
count none SELECT count(DISTINCT class_section) FROM CLASS WHERE crs_code  =  'ACCT-211'
SELECT DISTINCT T2.emp_fname ,  T3.prof_high_degree FROM CLASS AS T1 JOIN employee AS T2 ON T1.prof_num  =  T2.emp_num JOIN professor AS T3 ON T2.emp_num  =  T3.emp_num JOIN department AS T4 ON T4.dept_code  =  T3.dept_code WHERE T4.dept_name  =  'Computer Info. Systems'
SELECT DISTINCT T2.emp_fname ,  T3.prof_high_degree FROM CLASS AS T1 JOIN employee AS T2 ON T1.prof_num  =  T2.emp_num JOIN professor AS T3 ON T2.emp_num  =  T3.emp_num JOIN department AS T4 ON T4.dept_code  =  T3.dept_code WHERE T4.dept_name  =  'Computer Info. Systems'
SELECT DISTINCT T2.emp_fname ,  T3.prof_high_degree FROM CLASS AS T1 JOIN employee AS T2 ON T1.prof_num  =  T2.emp_num JOIN professor AS T3 ON T2.emp_num  =  T3.emp_num JOIN department AS T4 ON T4.dept_code  =  T3.dept_code WHERE T4.dept_name  =  'Computer Info. Systems'
SELECT DISTINCT T2.emp_fname ,  T3.prof_high_degree FROM CLASS AS T1 JOIN employee AS T2 ON T1.prof_num  =  T2.emp_num JOIN professor AS T3 ON T2.emp_num  =  T3.emp_num JOIN department AS T4 ON T4.dept_code  =  T3.dept_code WHERE T4.dept_name  =  'Computer Info. Systems'
count none SELECT count(DISTINCT POSITION) FROM player
count none SELECT count(DISTINCT POSITION) FROM player
SELECT DISTINCT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.rating  >  9
SELECT DISTINCT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.rating  >  9
SELECT DISTINCT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.rating  >  9
SELECT DISTINCT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.rating  >  9
SELECT DISTINCT T1.file_size ,  T1.formats FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T2.resolution  <  800
SELECT DISTINCT T1.file_size ,  T1.formats FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T2.resolution  <  800
SELECT DISTINCT T1.file_size ,  T1.formats FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T2.resolution  <  800
SELECT DISTINCT T1.file_size ,  T1.formats FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T2.resolution  <  800
count none SELECT count(DISTINCT brand) FROM camera_lens
count none SELECT count(DISTINCT T2.camera_lens_id) FROM mountain AS T1 JOIN photos AS T2 ON T1.id  =  T2.mountain_id WHERE T1.country  =  'Ethiopia'
count none SELECT count(DISTINCT program_id) FROM broadcast WHERE time_of_day  =  'Night'
count none SELECT count(DISTINCT program_id) FROM broadcast WHERE time_of_day  =  'Night'
count none SELECT count(DISTINCT OWNER) FROM channel
count none SELECT count(DISTINCT OWNER) FROM channel
count none SELECT count(DISTINCT student_id) FROM Student_Course_Enrolment
count none SELECT count(DISTINCT student_id) FROM Student_Course_Enrolment
count none SELECT count(DISTINCT roomtype) FROM room
count none SELECT count(DISTINCT roomtype) FROM room
SELECT DISTINCT T1.name ,  T1.position FROM physician AS T1 JOIN prescribes AS T2 ON T1.employeeid = T2.physician JOIN medication AS T3 ON T3.code = T2.medication WHERE T3.Brand  =  "X"
SELECT DISTINCT T1.name ,  T1.position FROM physician AS T1 JOIN prescribes AS T2 ON T1.employeeid = T2.physician JOIN medication AS T3 ON T3.code = T2.medication WHERE T3.Brand  =  "X"
SELECT DISTINCT T1.name ,  T1.position FROM physician AS T1 JOIN prescribes AS T2 ON T1.employeeid = T2.physician JOIN medication AS T3 ON T3.code = T2.medication WHERE T3.Brand  =  "X"
SELECT DISTINCT T1.name ,  T1.position FROM physician AS T1 JOIN prescribes AS T2 ON T1.employeeid = T2.physician JOIN medication AS T3 ON T3.code = T2.medication WHERE T3.Brand  =  "X"
SELECT DISTINCT classroom ,  grade FROM list
SELECT DISTINCT classroom ,  grade FROM list
SELECT DISTINCT classroom ,  grade FROM list
SELECT DISTINCT classroom ,  grade FROM list
SELECT DISTINCT firstname ,  lastname FROM teachers
SELECT DISTINCT firstname ,  lastname FROM teachers
SELECT DISTINCT firstname ,  lastname FROM teachers
SELECT DISTINCT firstname ,  lastname FROM teachers
SELECT DISTINCT firstname ,  lastname FROM list
SELECT DISTINCT firstname ,  lastname FROM list
SELECT DISTINCT firstname ,  lastname FROM list
SELECT DISTINCT firstname ,  lastname FROM list
SELECT DISTINCT T1.firstname ,  T1.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T1.grade  =  1 EXCEPT SELECT T1.firstname ,  T1.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T2.firstname  =  "OTHA" AND T2.lastname  =  "MOYER"
SELECT DISTINCT T1.firstname ,  T1.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T1.grade  =  1 EXCEPT SELECT T1.firstname ,  T1.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T2.firstname  =  "OTHA" AND T2.lastname  =  "MOYER"
SELECT DISTINCT T1.firstname ,  T1.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T1.grade  =  1 EXCEPT SELECT T1.firstname ,  T1.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T2.firstname  =  "OTHA" AND T2.lastname  =  "MOYER"
SELECT DISTINCT T1.firstname ,  T1.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T1.grade  =  1 EXCEPT SELECT T1.firstname ,  T1.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T2.firstname  =  "OTHA" AND T2.lastname  =  "MOYER"
count none SELECT grade ,  count(DISTINCT classroom) ,  count(*) FROM list GROUP BY grade
count none SELECT grade ,  count(DISTINCT classroom) ,  count(*) FROM list GROUP BY grade
count none SELECT classroom ,  count(DISTINCT grade) FROM list GROUP BY classroom
count none SELECT classroom ,  count(DISTINCT grade) FROM list GROUP BY classroom

count none SELECT count(DISTINCT t2.position) FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid WHERE t1.clubname  =  "Bootup Baltimore"
count none SELECT count(DISTINCT t2.position) FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid WHERE t1.clubname  =  "Bootup Baltimore"
count none SELECT count(DISTINCT t1.clubname) FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid JOIN student AS t3 ON t2.stuid  =  t3.stuid WHERE t3.fname  =  "Eric" AND t3.lname  =  "Tai"
count none SELECT count(DISTINCT t1.clubname) FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid JOIN student AS t3 ON t2.stuid  =  t3.stuid WHERE t3.fname  =  "Eric" AND t3.lname  =  "Tai"
count none SELECT count(DISTINCT role_code) FROM Project_Staff
count none SELECT count(DISTINCT role_code) FROM Project_Staff
count none SELECT count(DISTINCT city) FROM Person
count none SELECT count(DISTINCT city) FROM Person
count none SELECT count(DISTINCT job) FROM Person
count none SELECT count(DISTINCT job) FROM Person
SELECT DISTINCT T1.name ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend  =  'Dan' OR T2.friend  =  'Alice'
SELECT DISTINCT T1.name ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend  =  'Dan' OR T2.friend  =  'Alice'
SELECT DISTINCT T1.name ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend  =  'Dan' OR T2.friend  =  'Alice'
SELECT DISTINCT T1.name ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend  =  'Dan' OR T2.friend  =  'Alice'
SELECT DISTINCT T2.name ,  T2.friend ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.friend WHERE T1.age  >  (SELECT avg(age) FROM person)
SELECT DISTINCT T2.name ,  T2.friend ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.friend WHERE T1.age  >  (SELECT avg(age) FROM person)
SELECT DISTINCT T2.name ,  T2.friend ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.friend WHERE T1.age  >  (SELECT avg(age) FROM person)
SELECT DISTINCT T2.name ,  T2.friend ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.friend WHERE T1.age  >  (SELECT avg(age) FROM person)
SELECT DISTINCT T2.name ,  T2.friend ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.friend WHERE T1.age  >  (SELECT avg(age) FROM person)
SELECT DISTINCT T2.name ,  T2.friend ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.friend WHERE T1.age  >  (SELECT avg(age) FROM person)
count none SELECT count(DISTINCT name) FROM PersonFriend WHERE friend NOT IN (SELECT name FROM person WHERE city  =  'Austin')
count none SELECT count(DISTINCT name) FROM PersonFriend WHERE friend NOT IN (SELECT name FROM person WHERE city  =  'Austin')
count none SELECT count(DISTINCT Industry) FROM Companies
count none SELECT count(DISTINCT Industry) FROM Companies
count none SELECT COUNT(DISTINCT StuID) FROM ENROLLED_IN WHERE Grade  =  "B"
count none SELECT COUNT(DISTINCT StuID) FROM ENROLLED_IN WHERE Grade  =  "B"
count none SELECT count(DISTINCT product_type_code) FROM products
count none SELECT count(DISTINCT product_type_code) FROM products
SELECT DISTINCT T1.supplier_name ,  T1.supplier_phone FROM suppliers AS T1 JOIN product_suppliers AS T2 ON T1.supplier_id  =  T2.supplier_id JOIN products AS T3 ON T2.product_id  =  T3.product_id WHERE T3.product_name  =  "red jeans"
SELECT DISTINCT T1.supplier_name ,  T1.supplier_phone FROM suppliers AS T1 JOIN product_suppliers AS T2 ON T1.supplier_id  =  T2.supplier_id JOIN products AS T3 ON T2.product_id  =  T3.product_id WHERE T3.product_name  =  "red jeans"
SELECT DISTINCT T1.supplier_name ,  T1.supplier_phone FROM suppliers AS T1 JOIN product_suppliers AS T2 ON T1.supplier_id  =  T2.supplier_id JOIN products AS T3 ON T2.product_id  =  T3.product_id WHERE T3.product_name  =  "red jeans"
SELECT DISTINCT T1.supplier_name ,  T1.supplier_phone FROM suppliers AS T1 JOIN product_suppliers AS T2 ON T1.supplier_id  =  T2.supplier_id JOIN products AS T3 ON T2.product_id  =  T3.product_id WHERE T3.product_name  =  "red jeans"
SELECT DISTINCT T2.thing_id ,  T2.Type_of_Thing_Code FROM Timed_Status_of_Things AS T1 JOIN Things AS T2 ON T1.thing_id  =  T2.thing_id WHERE T1.Status_of_Thing_Code  =  'Close' OR T1.Date_and_Date  <  '2017-06-19 02:59:21'
SELECT DISTINCT T2.thing_id ,  T2.Type_of_Thing_Code FROM Timed_Status_of_Things AS T1 JOIN Things AS T2 ON T1.thing_id  =  T2.thing_id WHERE T1.Status_of_Thing_Code  =  'Close' OR T1.Date_and_Date  <  '2017-06-19 02:59:21'
count none SELECT count(DISTINCT T2.Location_Code) FROM Things AS T1 JOIN Timed_Locations_of_Things AS T2 ON T1.thing_id  =  T2.thing_id WHERE T1.service_details  =  'Unsatisfied'
count none SELECT count(DISTINCT Status_of_Thing_Code) FROM Timed_Status_of_Things
count none SELECT count(DISTINCT POSITION) FROM player
count none SELECT count(DISTINCT POSITION) FROM player
count none SELECT count(DISTINCT cName) FROM tryout
count none SELECT count(DISTINCT cName) FROM tryout
count none SELECT count(DISTINCT pPos) FROM tryout
count none SELECT count(DISTINCT pPos) FROM tryout
SELECT DISTINCT T1.state ,  T1.enr FROM college AS T1 JOIN tryout AS T2 ON T1.cName  =  T2.cName WHERE T2.decision  =  'yes'
SELECT DISTINCT T1.state ,  T1.enr FROM college AS T1 JOIN tryout AS T2 ON T1.cName  =  T2.cName WHERE T2.decision  =  'yes'
SELECT DISTINCT T1.state ,  T1.enr FROM college AS T1 JOIN tryout AS T2 ON T1.cName  =  T2.cName WHERE T2.decision  =  'yes'
SELECT DISTINCT T1.state ,  T1.enr FROM college AS T1 JOIN tryout AS T2 ON T1.cName  =  T2.cName WHERE T2.decision  =  'yes'
count none SELECT count(DISTINCT state) FROM college WHERE enr  >  (SELECT avg(enr) FROM college)
count none SELECT count(DISTINCT state) FROM college WHERE enr  >  (SELECT avg(enr) FROM college)
count none SELECT count(DISTINCT state) FROM college WHERE enr  <  (SELECT avg(enr) FROM college)
count none SELECT count(DISTINCT state) FROM college WHERE enr  <  (SELECT avg(enr) FROM college)
count none SELECT count(DISTINCT Software_Platform) FROM device
count none SELECT count(DISTINCT Software_Platform) FROM device
count none SELECT count(DISTINCT Currency_Code) FROM Drama_Workshop_Groups
count none SELECT count(DISTINCT Currency_Code) FROM Drama_Workshop_Groups
count none SELECT count(DISTINCT label) FROM albums
count none SELECT count(DISTINCT label) FROM albums
count none SELECT count(DISTINCT instrument) FROM instruments AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE title  =  "Le Pop"
count none SELECT count(DISTINCT instrument) FROM instruments AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE title  =  "Le Pop"
count none SELECT count(DISTINCT instrument) FROM instruments AS T1 JOIN Band AS T2 ON T1.bandmateid  =  T2.id WHERE T2.lastname  =  "Heilo"
count none SELECT count(DISTINCT instrument) FROM instruments AS T1 JOIN Band AS T2 ON T1.bandmateid  =  T2.id WHERE T2.lastname  =  "Heilo"
count none SELECT count(DISTINCT title) FROM vocals AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE TYPE  =  "lead"
count none SELECT count(DISTINCT title) FROM vocals AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE TYPE  =  "lead"
count none SELECT count(DISTINCT instrument) FROM instruments AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE title  =  "Badlands"
count none SELECT count(DISTINCT instrument) FROM instruments AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE title  =  "Badlands"
count none SELECT count(DISTINCT title) FROM vocals AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE TYPE  =  "shared"
count none SELECT count(DISTINCT title) FROM vocals AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE TYPE  =  "shared"
count none SELECT count(DISTINCT T3.title) FROM albums AS T1 JOIN tracklists AS T2 ON T1.aid  =  T2.albumid JOIN songs AS T3 ON T2.songid  =  T3.songid WHERE t1.type  =  "Studio"
count none SELECT count(DISTINCT T3.title) FROM albums AS T1 JOIN tracklists AS T2 ON T1.aid  =  T2.albumid JOIN songs AS T3 ON T2.songid  =  T3.songid WHERE t1.type  =  "Studio"
count none SELECT count(DISTINCT T1.name) ,  T2.Headquarter FROM products AS T1 JOIN manufacturers AS T2 ON T1.Manufacturer  =  T2.code GROUP BY T2.Headquarter
count none SELECT count(DISTINCT T1.name) ,  T2.Headquarter FROM products AS T1 JOIN manufacturers AS T2 ON T1.Manufacturer  =  T2.code GROUP BY T2.Headquarter
count none SELECT count(DISTINCT name) FROM products WHERE name NOT IN (SELECT T1.name FROM products AS T1 JOIN manufacturers AS T2 ON T1.Manufacturer  =  T2.code WHERE T2.name  =  'Sony')
count none SELECT count(DISTINCT name) FROM products WHERE name NOT IN (SELECT T1.name FROM products AS T1 JOIN manufacturers AS T2 ON T1.Manufacturer  =  T2.code WHERE T2.name  =  'Sony')
SELECT DISTINCT staff_first_name ,  staff_last_name FROM staff AS T1 JOIN problem_log AS T2 ON T1.staff_id = T2.assigned_to_staff_id WHERE T2.problem_id = 1
SELECT DISTINCT staff_first_name ,  staff_last_name FROM staff AS T1 JOIN problem_log AS T2 ON T1.staff_id = T2.assigned_to_staff_id WHERE T2.problem_id = 1
SELECT DISTINCT staff_first_name ,  staff_last_name FROM staff AS T1 JOIN problem_log AS T2 ON T1.staff_id = T2.assigned_to_staff_id WHERE T2.problem_id = 1
SELECT DISTINCT staff_first_name ,  staff_last_name FROM staff AS T1 JOIN problem_log AS T2 ON T1.staff_id = T2.assigned_to_staff_id WHERE T2.problem_id = 1
SELECT DISTINCT T2.problem_id ,  T2.problem_log_id FROM staff AS T1 JOIN problem_log AS T2 ON T1.staff_id = T2.assigned_to_staff_id WHERE T1.staff_first_name = "Rylan" AND T1.staff_last_name = "Homenick"
SELECT DISTINCT T2.problem_id ,  T2.problem_log_id FROM staff AS T1 JOIN problem_log AS T2 ON T1.staff_id = T2.assigned_to_staff_id WHERE T1.staff_first_name = "Rylan" AND T1.staff_last_name = "Homenick"
SELECT DISTINCT T2.problem_id ,  T2.problem_log_id FROM staff AS T1 JOIN problem_log AS T2 ON T1.staff_id = T2.assigned_to_staff_id WHERE T1.staff_first_name = "Rylan" AND T1.staff_last_name = "Homenick"
SELECT DISTINCT T2.problem_id ,  T2.problem_log_id FROM staff AS T1 JOIN problem_log AS T2 ON T1.staff_id = T2.assigned_to_staff_id WHERE T1.staff_first_name = "Rylan" AND T1.staff_last_name = "Homenick"
count none SELECT count(DISTINCT LEVEL) FROM member
count none SELECT count(DISTINCT LEVEL) FROM member
count none SELECT count(DISTINCT President_Vote) FROM VOTING_RECORD
count none SELECT count(DISTINCT President_Vote) FROM VOTING_RECORD
SELECT DISTINCT Registration_Date ,  Election_Cycle FROM VOTING_RECORD
SELECT DISTINCT Registration_Date ,  Election_Cycle FROM VOTING_RECORD
SELECT DISTINCT Registration_Date ,  Election_Cycle FROM VOTING_RECORD
SELECT DISTINCT Registration_Date ,  Election_Cycle FROM VOTING_RECORD
SELECT DISTINCT President_Vote ,  VICE_President_Vote FROM VOTING_RECORD
SELECT DISTINCT President_Vote ,  VICE_President_Vote FROM VOTING_RECORD
SELECT DISTINCT President_Vote ,  VICE_President_Vote FROM VOTING_RECORD
SELECT DISTINCT President_Vote ,  VICE_President_Vote FROM VOTING_RECORD
SELECT DISTINCT T1.Fname ,  T1.LName FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.President_VOTE WHERE T1.sex  =  "F"
SELECT DISTINCT T1.Fname ,  T1.LName FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.President_VOTE WHERE T1.sex  =  "F"
SELECT DISTINCT T1.Fname ,  T1.LName FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.President_VOTE WHERE T1.sex  =  "F"
SELECT DISTINCT T1.Fname ,  T1.LName FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.President_VOTE WHERE T1.sex  =  "F"
SELECT DISTINCT T1.Fname ,  T1.LName FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.VICE_President_VOTE WHERE T1.age  =  18
SELECT DISTINCT T1.Fname ,  T1.LName FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.VICE_President_VOTE WHERE T1.age  =  18
SELECT DISTINCT T1.Fname ,  T1.LName FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.VICE_President_VOTE WHERE T1.age  =  18
SELECT DISTINCT T1.Fname ,  T1.LName FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.VICE_President_VOTE WHERE T1.age  =  18
count none SELECT count(DISTINCT t3.characteristic_name) FROM products AS t1 JOIN product_characteristics AS t2 ON t1.product_id  =  t2.product_id JOIN CHARACTERISTICS AS t3 ON t2.characteristic_id  =  t3.characteristic_id WHERE t1.product_name  =  "sesame"
count none SELECT count(DISTINCT t3.characteristic_name) FROM products AS t1 JOIN product_characteristics AS t2 ON t1.product_id  =  t2.product_id JOIN CHARACTERISTICS AS t3 ON t2.characteristic_id  =  t3.characteristic_id WHERE t1.product_name  =  "sesame"
count none SELECT count(DISTINCT city) FROM stadium WHERE opening_year  <  2006
count none SELECT count(DISTINCT nationality) FROM swimmer

count none SELECT count(DISTINCT dormid) FROM has_amenity
count none SELECT count(DISTINCT dormid) FROM has_amenity
count none SELECT count(DISTINCT gender) FROM dorm
count none SELECT count(DISTINCT gender) FROM dorm
count none SELECT count(DISTINCT major) ,  count(DISTINCT city_code) FROM student
count none SELECT count(DISTINCT major) ,  count(DISTINCT city_code) FROM student
count none SELECT count(DISTINCT major) ,  count(DISTINCT city_code) FROM student
count none SELECT count(DISTINCT major) ,  count(DISTINCT city_code) FROM student
count none SELECT count(DISTINCT complaint_type_code) FROM complaints
count none SELECT count(DISTINCT complaint_type_code) FROM complaints
count none SELECT T2.Author ,  COUNT(DISTINCT T1.workshop_id) FROM acceptance AS T1 JOIN submission AS T2 ON T1.Submission_ID  =  T2.Submission_ID GROUP BY T2.Author
count none SELECT T2.Author ,  COUNT(DISTINCT T1.workshop_id) FROM acceptance AS T1 JOIN submission AS T2 ON T1.Submission_ID  =  T2.Submission_ID GROUP BY T2.Author
count none SELECT COUNT(DISTINCT transaction_type_code) FROM TRANSACTIONS
count none SELECT count(DISTINCT Name) FROM PHOTOS
count none SELECT count(DISTINCT Name) FROM PHOTOS
count none SELECT count(DISTINCT gtype) FROM Video_games
count none SELECT count(DISTINCT gtype) FROM Video_games
count none SELECT count(DISTINCT sportname) FROM Sportsinfo
count none SELECT count(DISTINCT sportname) FROM Sportsinfo
count none SELECT count(DISTINCT StuID) FROM Sportsinfo
count none SELECT count(DISTINCT StuID) FROM Sportsinfo
count none SELECT count(DISTINCT StuID) FROM Plays_games
count none SELECT count(DISTINCT StuID) FROM Plays_games
count none SELECT count(DISTINCT t3.product_id) FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id WHERE t1.customer_name  =  "Rodrick Heaney"
count none SELECT count(DISTINCT t3.product_id) FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id WHERE t1.customer_name  =  "Rodrick Heaney"
count none SELECT count(DISTINCT customer_id) FROM customer_orders WHERE order_status  =  "Cancelled"
count none SELECT count(DISTINCT customer_id) FROM customer_orders WHERE order_status  =  "Cancelled"
count none SELECT COUNT(DISTINCT Artist_ID) FROM volume
count none SELECT COUNT(DISTINCT Artist_ID) FROM volume
count none SELECT COUNT(DISTINCT Artist_ID) FROM volume
count none SELECT COUNT(DISTINCT Artist_ID) FROM volume
count none SELECT count(DISTINCT rank) FROM captain
count none SELECT count(DISTINCT rank) FROM captain
count none SELECT count(DISTINCT payment_method_code) FROM parties
count none SELECT count(DISTINCT payment_method_code) FROM parties
count none SELECT count(DISTINCT scientist) FROM assignedto
count none SELECT count(DISTINCT scientist) FROM assignedto
count none SELECT count(DISTINCT name) FROM projects
count none SELECT count(DISTINCT name) FROM projects
count none SELECT count(DISTINCT FacID) FROM Faculty_participates_in
count none SELECT count(DISTINCT FacID) FROM Faculty_participates_in
count none SELECT count(DISTINCT city) FROM airports WHERE country  =  'Greenland'
count none SELECT count(DISTINCT city) FROM airports WHERE country  =  'Greenland'
count none SELECT count(DISTINCT dst_apid) FROM airlines AS T1 JOIN routes AS T2 ON T1.alid  =  T2.alid WHERE T1.name  =  'American Airlines'
count none SELECT count(DISTINCT dst_apid) FROM airlines AS T1 JOIN routes AS T2 ON T1.alid  =  T2.alid WHERE T1.name  =  'American Airlines'
SELECT DISTINCT T1.name ,  T1.nationality FROM architect AS T1 JOIN mill AS t2 ON T1.id  =  T2.architect_id
SELECT DISTINCT T1.name ,  T1.nationality FROM architect AS T1 JOIN mill AS t2 ON T1.id  =  T2.architect_id
count none SELECT COUNT (DISTINCT director) FROM movie
count none SELECT COUNT (DISTINCT director) FROM movie

## sequence data mining & initial labeling

In [4]:
import random

max_seq = 10
min_seq = 2
min_sim_th = 0.2
max_sim_th = 0.75

def cos_sine_sim(sen0, sen1):
    embeddings1 = model.encode(sen0, convert_to_tensor=False)
    embeddings2 = model.encode(sen1, convert_to_tensor=False)
    cosine_scores = util.pytorch_cos_sim(embeddings1, embeddings2)
    return cosine_scores

In [223]:
# generate sequence
import torch
from tqdm import tqdm
# print("randint: ", random.randint(2,4))

all_seqs_num = 0
all_seqs = {}

for name, group in tqdm(df.groupby("db_id")):
    # 1. NL query length
    nl_len = group.question_toks.agg(len)
    # 2. SQL length
    sql_len = group.query_toks_no_value.agg(len)
    group["nl_sql_len"] = (nl_len + sql_len)/2
    # 3. sort by sql_nl length
    group = group.sort_values('nl_sql_len', ascending=True)
    
    if len(group)>=2:
        sql_q = np.array([" ".join(v) for v in group.query_toks_no_value], dtype="object")
        nl_q = group.question.values
        
        selected = []
        nl_sq = []
        sql_sq = []
        for idx, (nl, sql) in enumerate(zip(nl_q, sql_q)):
            if idx not in selected:
                # natural language/sql similarity
                nl_sim = cos_sine_sim(nl, nl_q).numpy()[0]
                sql_sim  = cos_sine_sim(sql, sql_q).numpy()[0]
                # average similarity
                # mean_sim = (np.abs(nl_sim) + np.abs(sql_sim))/2
                mean_sim = nl_sim
                # print(f"NL sim: {nl_sim} \n SQL sim: {sql_sim} \n Mean sim: {mean_sim}")
                # sort out similarity value
                sort_idx = mean_sim.argsort()[::-1]
                sort_idx_filtered = [sid for sid in sort_idx if (mean_sim[sid] <= max_sim_th) and (mean_sim[sid]>min_sim_th) and (sid not in selected)]
                # print(mean_sim[sort_idx_filtered])
                if len(sort_idx_filtered)>=2:
                    rand_num = random.randint(min_seq, max_seq)
                    select_num = rand_num if len(sort_idx_filtered)>=rand_num else len(sort_idx_filtered)
                    # print(sql, nl_q[sort_idx_filtered[:select_num]])
                    # print(sql, sort_idx_filtered[:select_num], nl_q[sort_idx_filtered[:select_num]])
                    selected.extend(sort_idx_filtered[:select_num])
                    nl_sq.append(nl_q[sort_idx_filtered[:select_num]].tolist())
                    sql_sq.append(sql_q[sort_idx_filtered[:select_num]].tolist())
        all_seqs_num += len(selected_sq)
        if len(selected_sq)>0:
            all_seqs[name] = {}
            all_seqs[name]["nl"] = nl_sq
            all_seqs[name]["sql"] = sql_sq
print(f"all_seqs_num: {all_seqs_num}")
with open(f"../backend/app/data/dataset/spider/query_seq.json", "w") as f:
    json.dump(all_seqs, f)
print(len(all_seqs.keys()), all_seqs.keys())

100%|â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆ| 140/140 [03:45<00:00,  1.61s/it]

all_seqs_num: 1820
140 dict_keys(['activity_1', 'aircraft', 'allergy_1', 'apartment_rentals', 'architecture', 'assets_maintenance', 'baseball_1', 'behavior_monitoring', 'bike_1', 'body_builder', 'book_2', 'browser_web', 'candidate_poll', 'chinook_1', 'cinema', 'city_record', 'climbing', 'club_1', 'coffee_shop', 'college_1', 'college_2', 'college_3', 'company_1', 'company_employee', 'company_office', 'county_public_safety', 'cre_Doc_Control_Systems', 'cre_Doc_Tracking_DB', 'cre_Docs_and_Epenses', 'cre_Drama_Workshop_Groups', 'cre_Theme_park', 'csu_1', 'culture_company', 'customer_complaints', 'customer_deliveries', 'customers_and_addresses', 'customers_and_invoices', 'customers_and_products_contacts', 'customers_campaigns_ecommerce', 'customers_card_transactions', 'debate', 'decoration_competition', 'department_management', 'department_store', 'device', 'document_management', 'dorm_1', 'driving_school', 'e_government', 'e_learning', 'election', 'election_representative', 'entertainment_awards', 'entrepreneur', 'epinions_1', 'farm', 'film_rank', 'flight_1', 'flight_4', 'flight_company', 'formula_1', 'game_1', 'game_injury', 'gas_company', 'gymnast', 'hospital_1', 'hr_1', 'icfp_1', 'inn_1', 'insurance_and_eClaims', 'insurance_fnol', 'insurance_policies', 'journal_committee', 'loan_1', 'local_govt_and_lot', 'local_govt_in_alabama', 'local_govt_mdm', 'machine_repair', 'manufactory_1', 'manufacturer', 'match_season', 'medicine_enzyme_interaction', 'mountain_photos', 'movie_1', 'music_1', 'music_2', 'music_4', 'musical', 'network_2', 'news_report', 'party_host', 'party_people', 'performance_attendance', 'perpetrator', 'phone_1', 'phone_market', 'pilot_record', 'product_catalog', 'products_for_hire', 'products_gen_characteristics', 'program_share', 'protein_institute', 'race_track', 'railway', 'restaurant_1', 'riding_club', 'roller_coaster', 'sakila_1', 'school_bus', 'school_finance', 'school_player', 'scientist_1', 'ship_1', 'ship_mission', 'shop_membership', 'small_bank_1', 'soccer_1', 'soccer_2', 'solvency_ii', 'sports_competition', 'station_weather', 'store_1', 'store_product', 'storm_record', 'student_1', 'student_assessment', 'swimming', 'theme_gallery', 'tracking_grants_for_research', 'tracking_orders', 'tracking_share_transactions', 'tracking_software_problems', 'train_station', 'twitter_1', 'university_basketball', 'voter_2', 'wedding', 'wine_1', 'workshop_paper', 'wrestler'])

## Seq examples

1. select distinct building from faculty 
['In which buildings are there at least ten professors?'
 'Find the building that has the largest number of faculty members.'
 'Show all the distinct buildings that have faculty rooms.'
 'How many faculty members does each building have? List the result with the name of the building.'
 'Show all the buildings along with the number of faculty members the buildings have.'
 'How many faculty do we have?'
 'What is the first and last name of the faculty participating in the most activities?']
 
2. select activity_name from activity ['What activities do we have?' 'How many activities do we have?'
 'Find the number of activities available.']
 
3. select distinct rank from faculty ['What are the rank, first name, and last name of the faculty members?'
 'Which rank has the smallest number of faculty members?'
 'What are the faculty ids of all the male faculty members?'
 'What is the total number of faculty members?'
 'How many faculty members participate in an activity?'
 'What are the first and last name of the faculty who has the most students?'
 'Show all the ranks and the number of male and female faculty for each rank.'
 'Which building has most faculty members?']
 
4. select distinct rank from faculty ['For each faculty rank, show the number of faculty members who have it.'
 'How many faculty members do we have for each faculty rank?'
 'Find the faculty rank that has the least members.'
 'Show the rank, first name, and last name for all the faculty.'
 'How many faculty members do we have for each rank and gender?'
 'Show all the faculty ranks and the number of students advised by each rank.'
 'How many students are advised by each rank of faculty? List the rank and the number of students.']
 
5. select facid from faculty where sex = value ['Show the ids for all the faculty members who have at least 2 students.'
 'Show the ids of all the faculty members who participate in an activity and advise a student.'
 'Show the ids of students whose advisors are professors.'
 'Show the faculty id of each faculty member, along with the number of students he or she advises.'
 "Show ids for the faculty members who don't advise any student."
 'What are ids of the faculty members who not only participate in an activity but also advise a student.']
 
6. select count ( distinct facid ) from faculty_participates_in ['What are the faculty id and the number of students each faculty has?'
 'What is the first and last name of the faculty members who participated in at least one activity? For each of them, also show the number of activities they participated in.'
 'Show all the activity names and the number of faculty involved in each activity.'
 'Show the number of male and female assistant professors.']
 
7. select fname , lname from faculty where rank = value ['Show the first name, last name, and phone number for all female faculty members.'
 'Show the first and last name of all the faculty members who participated in some activity, together with the number of activities they participated in.'
 'Show first name and last name for all the students advised by Michael Goodrich.'
 'Give me the the first and last name of the faculty who advises the most students.'
 'Find the first and last name of the faculty who is involved in the largest number of activities.']
 
8. select stuid from student except select stuid from participates_in ['What are the ids of the students who are under 20 years old and are involved in at least one activity.'
 "Show the ids of the faculty who don't participate in any activity."
 'Show the ids for all the students who participate in an activity and are under 20.'
 'What are the ids of the faculty members who do not advise any student.']
 
9. select count ( * ) from faculty where rank = value and building = value ['How many female Professors do we have?'
 'How many male and female assistant professors do we have?'
 'Count the number of female Professors we have.'
 'Give me the number of faculty members who participate in an activity'
 'Show all the buildings that have at least 10 professors.'
 'What buildings have faculty offices?']
 
10. select fname , lname from faculty where rank = value ['What are the first name, last name, and phone number of all the female faculty members?'
 'What are the first names of the faculty members playing both Canoeing and Kayaking?'
 'What is the first and last name of the student participating in the most activities?']
 
11. select facid from faculty except select facid from faculty_participates_in ['Which faculty members advise two ore more students? Give me their faculty ids.'
 'What ranks do we have for faculty?'
 'Which students have professors as their advisors? Find their student ids.'
 'Which activity has the most faculty members participating in? Find the activity name.'
 'How many faculty members participate in each activity? Return the activity names and the number of faculty members.'
 'What are the ids of the students who are not involved in any activity'
 'What is the name of the activity that has the most faculty members involved in?'
 "Show the ids of the students who don't participate in any activity."
 'Find the first names of professors who are not playing Canoeing or Kayaking.'
 'Find the list of distinct ranks for faculty.']
 
12. select t2 . fname , t2 . lname from faculty as t1 join student as t2 on t1 . facid = t2 . advisor where t1 . fname = value and t1 . lname = value ['What are the first name and last name of all the instructors?'
 'Tell me the first and last name of the student who has the most activities.']
 
13. select distinct t1 . lname from faculty as t1 join faculty_participates_in as t2 on t1 . facid = t2 . facid join activity as t3 on t2 . actid = t2 . actid where t3 . activity_name = value or t3 . activity_name = value ['Find the ids of the students who participate in Canoeing and Kayaking.'
 'Show the first name and last name for all the instructors.'
 'Which students participate in both Canoeing and Kayaking as their activities? Tell me their student ids.']